# Folder Item Info Properties

Source: https://www.revitapidocs.com/2026/92c39d4f-4804-a0ff-6697-07d268adbb08.htm

---

| Folder Item Info Properties |
| --- |

The FolderItemInfo type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | **Obsolete.** The folder parameter Id |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The folder name |

Top See Also

#### Reference

FolderItemInfo Class Autodesk.Revit.DB Namespace